#pragma once
/*
* 	mr.Escow - Lesson-5
* * * * * * * * * * * * * * * */
#include "Header.h"

/*
	1.Создать шаблонную функцию, которая принимает итераторы на начало и конец последовательности слов, 
	и выводящую в консоль список уникальных слов (если слово повторяется больше 1 раза, то вывести его надо один раз). 
	Продемонстрировать работу функции, передав итераторы различных типов.
*/

/*
	2.Используя ассоциативный контейнер, напишите программу, 
	которая будет считывать данные введенные пользователем из стандартного потока ввода и разбивать их на предложения. 
	 программа должна вывести пользователю все предложения, отсортировав их по длине.
*/

int Lesson_5() {


	return 0;
}