#pragma once
/*
* 	mr.Escow - Lesson-3
* * * * * * * * * * * * * * * *
1.
	Ќаписать функцию, добавл€ющую в конец списка вещественных чисел элемент, 
	значение которого равно среднему арифметическому всех его элементов.
2.
	—оздать класс, представл€ющий матрицу. 
	–еализовать в нем метод, вычисл€ющий определитель матрицы.
3.
	–еализовать собственный класс итератора, 
	с помощью которого можно будет проитерироватьс€ по диапазону целых чисел в цикле for-range-based.

*/

int Lesson3(){
	return 0;
}