#pragma once
/*
* 	mr.Escow - Lesson-5
* * * * * * * * * * * * * * * */
#include "Header.h"
//-------------------------------------------------------------------------------------------
/*
	1.Создать шаблонную функцию, которая принимает итераторы на начало и конец последовательности слов, 
	и выводящую в консоль список уникальных слов (если слово повторяется больше 1 раза, то вывести его надо один раз). 
	Продемонстрировать работу функции, передав итераторы различных типов.
*/
//-------------------------------------------------------------------------------------------
template<typename IT>
void PrintUniqueStr(IT begin, IT end) {
	std::set<std::string> myset;
	for (; begin != end; ++begin) {
		myset.insert(*begin);
	}
	for (auto& str : myset) {
		std::cout << str << std::endl;
	}
}
//-------------------------------------------------------------------------------------------
/*
	2.Используя ассоциативный контейнер, напишите программу, 
	которая будет считывать данные введенные пользователем из стандартного потока ввода и разбивать их на предложения. 
	программа должна вывести пользователю все предложения, отсортировав их по длине.
*/
//-------------------------------------------------------------------------------------------
void SortUserData() {
	std::string UserData;
	getline(std::cin, UserData);
	std::istringstream ist(UserData);
	std::set<std::string> myset;
	for (std::string word; ist >> word; myset.insert(word));
	for (auto& str : myset) std::cout << str << std::endl;	
}
//-------------------------------------------------------------------------------------------
int Lesson5() {

	std::vector<std::string> freqs;
	std::ifstream fs("War and peace.txt");
	std::string text;
	while (fs >> text) 
		freqs.push_back(text);
	

	PrintUniqueStr(freqs.begin(), freqs.begin() + 10);

	std::cout << "---------------------\n";

	SortUserData();

	return 0;
}
//-------------------------------------------------------------------------------------------