#pragma once
/*
*	  mr.Escow - Lesson-2
* * * * * * * * * * * * * * * *

1.
	Реализуйте шаблонную функцию Swap, которая принимает два указателя и обменивает местами значения, 
	на которые указывают эти указатели(нужно обменивать именно сами указатели, переменные должны оставаться в тех же адресах памяти).

2.
	Реализуйте шаблонную функцию SortPointers, которая принимает вектор указателей и сортирует указатели по значениям, на которые они указывают.

3.
	Подсчитайте количество гласных букв в книге “Война и мир”.Для подсчета используйте 4 способа:
		○  count_if и find
		○  count_if и цикл for
		○  цикл for и find
		○  2 цикла for
	Замерьте время каждого способа подсчета и сделайте выводы.


Справка :
	count_if - это алгоритмическая функция из STL, которая принимает 3 параметра: 
	итератор на начало, итератор на конец и унарный предикат(функцию, принимающую один параметр и возвращающую тип bool).

	find - это метод класса string, который возвращает позицию символа(строки), переданного в качестве параметра, в исходной строке.
	Если символ не найден, то метод возвращает string::npos.
*/

int Lesson2() {
	return 0;
}
